const model = require('./src/model');

rootEnglish= {
    prefixes: ["a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o", "p", "r", "s", "t", "q", "u", "v", "w", "x", "y", "z"],
    category: "latin",
};

rootKorean = {
    prefixes : ["것" ,"하다" ,"있다" ,"수" ,"하다" ,"나" ,"없다" ,"않다" ,"사람" ,"우리" ,"그" ,"거" ,"년" ,"한"
    ,"말" ,"일" ,"이" ,"씨" ,"일" ,"안" ,"더" ,"집" ,"저" ,"속" ,"데" ,"앞" ,"중" ,"잘" ,"원" ,"명" ,"개" ,"다" ,"좀" ,"너" ,"눈" ,
    "뭐" ,"점" ,"곳" ,"안" ,"위" ,"번" ,"돈" ,"날" ,"후" ,"몸" ,"왜" ,"물" ,"길" ,"뿐" ,"손" ,"몇" ,"삶" ,"시" ,"못" ,"책" ,"힘" ,"쪽" ,
    "및" ,"글" ,"밖" ,"즉" ,"밤" ,"채" ,"아" ,"분" ,"곧" ,"방" ,"끝" ,"간" ,"듯" ,"입" ,"뭐" ,"줄" ,"밥" ,"네" ,"남" ,"적" ,"터" ,"술" ,
    "맛" ,"꼭" ,"세" ,"차" ,"각" ,"바" ,"시" ,"옆" ,"어" ,"예" ,"저" ,"배" ,"내" ,"산" ,"새" ,"문" ,"꽃" ,"분" ,"불" ,"대" ,"옷" ,"전" ,
    "꿈" ,"발" ,"살" ,"비" ,"법" ,"예" ,"달" ,"참" ,"잠" ,"면" ,"밑" ,"군" ,"팀" ,"첫" ,"약" ,"지" ,"쌀" ,"형" ,"늘" ,"전" ,"해" ,"회" ,
    "말" ,"셈" ,"값" ,"만" ,"빛" ,"야" ,"선" ,"반" ,"귀" ,"놈" ,"배" ,"술" ,"자" ,"잔" ,"외" ,"수" ,"배" ,"층" ,"장" ,"반" ,"편" ,"팔" ,
    "차" ,"세" ,"봄" ,"공" ,"과" ,"미" ,"숲" ,"한" ,"이" ,"골" ,"새" ,"응" ,"달" ,"키"],
    category : "korean"
};

pawpow = {
    prefixes : ['#가족', '#갈길이멀다', '#강아지🐶', '#같이웃자', '#개그', '#겨드랑이', '#고등학교친구', '#국제연애', '#국제연애절대로하지마라', '#국제커플', '#그림', '#그림스타그램', '#끄적', '#끄적끄적', '#끄적끄적그램', '#끄적임', '#남자친구', '#낮잠', '#낮잠타임', '#내코어쩔꺼야', '#다이어트', '#다이어트그램', '#답답', '#답답해', '#당황', '#대학생', '#덤덤', '#독서', '#독서스타그램', '#동기', '#동기부여', '#드로잉태블릿', '#똥배', '#레진코믹스', '#롱디', '#롱디커플', '#마냥로맨틱하지않아', '#마상', '#만화', '#만화그램', '#맛있겠다', '#망했다그램', '#맴찢', '#멍멍', '#모티베이션', '#무매너', '#무전여행', '#반려견🐶', '#반말', '#발그림', '#배고파', '#배고파그램', '#버니', '#번역', '#번역가', '#번역알바', '#베낭여행', '#병원', '#복학', '#복학생', '#빼애앰', '#사랑', '#사랑해요', '#사랑해💕', '#살빼자그램', '#생활', '#생활툰', '#서울나들이', '#선생님', '#선생님스타그램', '#성질급함', '#세계여행', '#세계일주', '#소개', '#슬로바키아', '#슬로바키아어', '#씹다수', '#아마추어통역사', '#아무것도할수있는', '#아픔', '#악수', '#안부', '#안부인사', '#안잔다그램', '#안잔척', '#애기', '#야식', '#어머니', '#어학당', '#언어', '#여행', '#여행그램', '#여행스타그램', '#여행에미치다', '#여행일기', '#영어', '#영어통역사', '#예쁜이', '#옷', '#옷스타그램', '#와콤타블렛', '#외국어', '#외국어공부', '#외국인남자친구', '#외모', '#외모지상주의', '#우울증', '#우울증극복', '#유럽여행', '#유머', '#유머스타그램', '#유학생', '#음악', '#응급실', '#인도', '#인도여행', '#인스타만화', '#인스타툰', '#인스타툰추천', '#일', '#자봉', '#자비좀요', '#자원봉사', '#장거리연애', '#장거리커플', '#제발', '#존댓말', '#존맛', '#지켜주지못해미안해', '#체코', '#체코어', '#체코어통역사', '#치킨', '#친구', '#친칠라', '#캠퍼스', '#캠퍼스룩', '#컬쳐쇼크', '#타지생활', '#탄피부', '#탈룰라', '#탈룰라급', '#택시안에서', '#통역', '#통역사', '#통역스타그램', '#티쳐스타그램', '#패션', '#편견깨기', '#편견천지', '#프라하', '#프러포즈', '#프로그래머', '#프로그래밍', '#하고싶었던말', '#한국', '#한국어', '#한국어공부', '#한국음식', '#한국인여자친구', '#할머니', '#할수있다', '#할아버지', '#행복', '#현실은', '#화이팅', '#휴가', '#힘내그램'],
    category : "pawpow"
};


function addRootTags(tagCollection) {
    tagCollection.prefixes.forEach(async (prefix) => {
        result = await model.HashTag.find({name:prefix}).exec();
        console.log(JSON.stringify(result));
        if (result.length) {
            console.log(`tag ${prefix} already contained in db. Skipping.`)
        }
        else {
            console.log(`Tag ${prefix} missing in database`);
        }

        let record = model.HashTag({name: prefix, parent:"", categories: [tagCollection.category]});
        record.save(function (err, saved) {
            if (err) return console.error(err);
            console.log(`Added new root tag ${saved.name}`);
        });
    });
}

// addRootTags(rootEnglish);
// addRootTags(rootKorean);
addRootTags(pawpow);
